In [5]:
import pandas as pd

In [7]:
df = pd.read_csv('./logradouros-maua-ibge.csv', encoding='utf-8')
df.head()

In [15]:
dfNomes = df[['NM_TIP_LOG', 'NM_TIT_LOG', 'NM_LOG']]
dfNomes.head()

  NM_TIP_LOG NM_TIT_LOG           NM_LOG
0    AVENIDA        NaN  WASHINGTON LUIZ
1        RUA        NaN             JAHU
2        RUA        NaN  TEOTONIO VILELA
3        RUA        NaN     JOAO GIANONI
4        RUA        NaN     JOAO GIANONI

In [16]:
dfNomes = dfNomes.fillna('')
dfNomes.head()

  NM_TIP_LOG NM_TIT_LOG           NM_LOG
0    AVENIDA             WASHINGTON LUIZ
1        RUA                        JAHU
2        RUA             TEOTONIO VILELA
3        RUA                JOAO GIANONI
4        RUA                JOAO GIANONI

In [19]:
dfNomes['LOGRA'] = dfNomes['NM_TIP_LOG'].astype(str) + ' ' + dfNomes['NM_TIT_LOG'].astype(str) + ' ' + dfNomes['NM_LOG'].astype(str)
dfNomes.head()

  NM_TIP_LOG NM_TIT_LOG           NM_LOG                     LOGRA
0    AVENIDA             WASHINGTON LUIZ  AVENIDA  WASHINGTON LUIZ
1        RUA                        JAHU                 RUA  JAHU
2        RUA             TEOTONIO VILELA      RUA  TEOTONIO VILELA
3        RUA                JOAO GIANONI         RUA  JOAO GIANONI
4        RUA                JOAO GIANONI         RUA  JOAO GIANONI

In [21]:
dfNome = dfNomes[['LOGRA']]
dfNome.head()

                      LOGRA
0  AVENIDA  WASHINGTON LUIZ
1                 RUA  JAHU
2      RUA  TEOTONIO VILELA
3         RUA  JOAO GIANONI
4         RUA  JOAO GIANONI

In [24]:
dfNome

                      LOGRA
0  AVENIDA  WASHINGTON LUIZ
1                 RUA  JAHU
2      RUA  TEOTONIO VILELA
3         RUA  JOAO GIANONI
4         RUA  JOAO GIANONI

In [31]:
# Cria uma nova série onde cada valor é o comprimento da string correspondente
comprimentos = dfNome.applymap(lambda x: len(str(x)))

# Encontra o valor máximo e sua localização
max_comprimento = comprimentos.max().max()
localizacao = comprimentos.stack().idxmax()

print(f"A maior string tem {max_comprimento} caracteres e está localizada em {localizacao}.")

A maior string tem 54 caracteres e está localizada em (1760, 'LOGRA').

In [29]:
maior_string = dfNome.loc[localizacao]
print(f"A maior string é '{maior_string}'.")

A maior string é 'RUA CAPITAO POLICIA MILITAR OLEGARIO TEIXEIRA DA COSTA'.

In [34]:
comprimento_maior_string = dfNomes['NM_LOG'].apply(lambda x: len(x)).max()

print(f"O comprimento da maior string na coluna é {comprimento_maior_string}.")

O comprimento da maior string na coluna é 43.

In [38]:
dfNomes.iloc[43]

NM_TIP_LOG                      RUA
NM_TIT_LOG
NM_LOG             FRANCISCO DA PAZ
LOGRA         RUA  FRANCISCO DA PAZ
Name: 43, dtype: object